RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_gpio.h
/* AFIO_EXTISS2 */
#define AFIO_EXTI8_SS                    BITS(0,3)           /*!< EXTI 8 sources selection */
#define AFIO_EXTI9_SS                    BITS(4,7)           /*!< EXTI 9 sources selection */
#define AFIO_EXTI10_SS                   BITS(8,11)          /*!< EXTI 10 sources selection */
#define AFIO_EXTI11_SS                   BITS(12,15)         /*!< EXTI 11 sources selection */

/* AFIO_EXTISS3 */
#define AFIO_EXTI12_SS                   BITS(0,3)           /*!< EXTI 12 sources selection */
#define AFIO_EXTI13_SS                   BITS(4,7)           /*!< EXTI 13 sources selection */
#define AFIO_EXTI14_SS                   BITS(8,11)          /*!< EXTI 14 sources selection */
#define AFIO_EXTI15_SS                   BITS(12,15)         /*!< EXTI 15 sources selection */

/* AFIO_PCF1 */
#define AFIO_PCF1_TIMER8_REMAP           BIT(5)              /*!< TIMER8 remapping */
#define AFIO_PCF1_TIMER9_REMAP           BIT(6)              /*!< TIMER9 remapping */
#define AFIO_PCF1_TIMER10_REMAP          BIT(7)              /*!< TIMER10 remapping */
#define AFIO_PCF1_TIMER12_REMAP          BIT(8)              /*!< TIMER12 remapping */
#define AFIO_PCF1_TIMER13_REMAP          BIT(9)              /*!< TIMER13 remapping */
#define AFIO_PCF1_EXMC_NADV              BIT(10)             /*!< EXMC_NADV connect/disconnect */

/* AFIO_PCF2 */
#define AFIO_PCF2_DCI_VSYNC_REMAP        BITS(0,1)           /*!< DCI VSYNC remapping */
#define AFIO_PCF2_DCI_D0_REMAP           BITS(2,3)           /*!< DCI D0 remapping */
#define AFIO_PCF2_DCI_D1_REMAP           BITS(4,5)           /*!< DCI D1 remapping */
#define AFIO_PCF2_DCI_D2_REMAP           BITS(6,7)           /*!< DCI D2 remapping */
#define AFIO_PCF2_DCI_D3_REMAP           BITS(8,9)           /*!< DCI D3 remapping */
#define AFIO_PCF2_DCI_D4_REMAP           BITS(10,11)         /*!< DCI D4 remapping */
#define AFIO_PCF2_DCI_D5_REMAP           BITS(12,13)         /*!< DCI D5 remapping */
#define AFIO_PCF2_DCI_D6_REMAP           BITS(14,15)         /*!< DCI D6 remapping */
#define AFIO_PCF2_DCI_D7_REMAP           BITS(16,17)         /*!< DCI D7 remapping */
#define AFIO_PCF2_DCI_D8_REMAP           BITS(18,19)         /*!< DCI D8 remapping */
#define AFIO_PCF2_DCI_D9_REMAP           BITS(20,21)         /*!< DCI D9 remapping */
#define AFIO_PCF2_DCI_D10_REMAP          BITS(22,23)         /*!< DCI D10 remapping */
#define AFIO_PCF2_DCI_D11_REMAP          BITS(24,25)         /*!< DCI D11 remapping */
#define AFIO_PCF2_DCI_D12_REMAP          BIT(26)             /*!< DCI D12 remapping */
#define AFIO_PCF2_DCI_D13_REMAP          BITS(27,28)         /*!< DCI D13 remapping */
#define AFIO_PCF2_DCI_HSYNC_REMAP        BIT(29)             /*!< DCI HSYNC remapping */
#define AFIO_PCF2_PH01_REMAP             BIT(31)             /*!< PH0/PH1 remapping */

/* AFIO_PCF3 */
#define AFIO_PCF3_TLI_B5_PA3_REMAP       BIT(0)              /*!< TLI B5 PA3 remapping */
#define AFIO_PCF3_TLI_VSYNC_PA4_REMAP    BIT(1)              /*!< TLI VSYNC PA4 remapping */
#define AFIO_PCF3_TLI_G2_PA6_REMAP       BIT(2)              /*!< TLI G2 PA6 remapping */
#define AFIO_PCF3_TLI_R6_PA8_REMAP       BIT(3)              /*!< TLI R6 PA8 remapping */
#define AFIO_PCF3_TLI_R4_PA11_REMAP      BIT(4)              /*!< TLI R4 PA11 remapping */
#define AFIO_PCF3_TLI_R5_PA12_REMAP      BIT(5)              /*!< TLI R5 PA12 remapping */
#define AFIO_PCF3_TLI_R3_PB0_REMAP       BIT(6)              /*!< TLI R3 PB0 remapping */
#define AFIO_PCF3_TLI_R6_PB1_REMAP       BIT(7)              /*!< TLI R6 PB1 remapping */
#define AFIO_PCF3_TLI_B6_PB8_REMAP       BIT(8)              /*!< TLI B6 PB8 remapping */
#define AFIO_PCF3_TLI_B7_PB9_REMAP       BIT(9)              /*!< TLI B7 PB9 remapping */
#define AFIO_PCF3_TLI_G4_PB10_REMAP      BIT(10)             /*!< TLI G4 PB10 remapping */
#define AFIO_PCF3_TLI_G5_PB11_REMAP      BIT(11)             /*!< TLI G5 PB11 remapping */
#define AFIO_PCF3_TLI_HSYNC_PC6_REMAP    BIT(12)             /*!< TLI HSYNC PC6 remapping */
#define AFIO_PCF3_TLI_G6_PC7_REMAP       BIT(13)             /*!< TLI G6 PC7 remapping */
#define AFIO_PCF3_TLI_R2_PC10_REMAP      BIT(14)             /*!< TLI R2 PC10 remapping */
#define AFIO_PCF3_TLI_G7_PD3_REMAP       BIT(15)             /*!< TLI G7 PD3 remapping */
#define AFIO_PCF3_TLI_B2_PD6_REMAP       BIT(16)             /*!< TLI B2 PD6 remapping */
#define AFIO_PCF3_TLI_B3_PD10_REMAP      BIT(17)             /*!< TLI B3 PD10 remapping */
#define AFIO_PCF3_TLI_B0_PE4_REMAP       BIT(18)             /*!< TLI B0 PE4 remapping */
#define AFIO_PCF3_TLI_G0_PE5_REMAP       BIT(19)             /*!< TLI G0 PE5 remapping */
#define AFIO_PCF3_TLI_G1_PE6_REMAP       BIT(20)             /*!< TLI G1 PE6 remapping */
#define AFIO_PCF3_TLI_G3_PE11_REMAP      BIT(21)             /*!< TLI G3 PE11 remapping */
#define AFIO_PCF3_TLI_B4_PE12_REMAP      BIT(22)             /*!< TLI B4 PE12 remapping */
#define AFIO_PCF3_TLI_DE_PE13_REMAP      BIT(23)             /*!< TLI DE PE13 remapping */
#define AFIO_PCF3_TLI_CLK_PE14_REMAP     BIT(24)             /*!< TLI CLK PE14 remapping */
#define AFIO_PCF3_TLI_R7_PE15_REMAP      BIT(25)             /*!< TLI R7 PE15 remapping */
#define AFIO_PCF3_TLI_DE_PF10_REMAP      BIT(26)             /*!< TLI DE PF10 remapping */
#define AFIO_PCF3_TLI_R7_PG6_REMAP       BIT(27)             /*!< TLI R7 PG6 remapping */
#define AFIO_PCF3_TLI_CLK_PG7_REMAP      BIT(28)             /*!< TLI CLK PG7 remapping */
#define AFIO_PCF3_TLI_G3_PG10_REMAP      BIT(29)             /*!< TLI G3 PG10 remapping */
#define AFIO_PCF3_TLI_B2_PG10_REMAP      BIT(30)             /*!< TLI B2 PG10 remapping */
#define AFIO_PCF3_TLI_B3_PG11_REMAP      BIT(31)             /*!< TLI B3 PG11 remapping */

/* AFIO_PCF4 */
#define AFIO_PCF4_TLI_B4_PG12_REMAP      BIT(0)              /*!< TLI B4 PG12 remapping  */
#define AFIO_PCF4_TLI_B1_PG12_REMAP      BIT(1)              /*!< TLI B1 PG12 remapping  */
#define AFIO_PCF4_TLI_R0_PH2_REMAP       BIT(2)              /*!< TLI R0 PH2 remapping  */
#define AFIO_PCF4_TLI_R1_PH3_REMAP       BIT(3)              /*!< TLI R1 PH3 remapping  */
#define AFIO_PCF4_TLI_R2_PH8_REMAP       BIT(4)              /*!< TLI R2 PH8 remapping  */
#define AFIO_PCF4_TLI_R3_PH9_REMAP       BIT(5)              /*!< TLI R3 PH9 remapping  */
#define AFIO_PCF4_TLI_R4_PH10_REMAP      BIT(6)              /*!< TLI R4 PH10 remapping  */
#define AFIO_PCF4_TLI_R5_PH11_REMAP      BIT(7)              /*!< TLI R5 PH11 remapping  */
#define AFIO_PCF4_TLI_R6_PH12_REMAP      BIT(8)              /*!< TLI R6 PH12 remapping  */
#define AFIO_PCF4_TLI_G2_PH13_REMAP      BIT(9)              /*!< TLI G2 PH13 remapping  */
#define AFIO_PCF4_TLI_G3_PH14_REMAP      BIT(10)             /*!< TLI G3 PH14 remapping  */
#define AFIO_PCF4_TLI_G4_PH15_REMAP      BIT(11)             /*!< TLI G4 PH15 remapping  */
#define AFIO_PCF4_TLI_G5_PI0_REMAP       BIT(12)             /*!< TLI G5 PI0 remapping  */
#define AFIO_PCF4_TLI_G6_PI1_REMAP       BIT(13)             /*!< TLI G6 PI1 remapping  */
#define AFIO_PCF4_TLI_G7_PI2_REMAP       BIT(14)             /*!< TLI G7 PI2 remapping  */
#define AFIO_PCF4_TLI_B4_PI4_REMAP       BIT(15)             /*!< TLI B4 PI4 remapping  */
#define AFIO_PCF4_TLI_B5_PI5_REMAP       BIT(16)             /*!< TLI B5 PI5 remapping  */
#define AFIO_PCF4_TLI_B6_PI6_REMAP       BIT(17)             /*!< TLI B6 PI6 remapping  */
#define AFIO_PCF4_TLI_B7_PI7_REMAP       BIT(18)             /*!< TLI B7 PI7 remapping  */
#define AFIO_PCF4_TLI_VSYNC_PI9_REMAP    BIT(19)             /*!< TLI VSYNC PI9 remapping  */
#define AFIO_PCF4_TLI_HSYNC_PI10_REMAP   BIT(20)             /*!< TLI HSYNC PI10 remapping  */
#define AFIO_PCF4_TLI_R0_PH4_REMAP       BIT(21)             /*!< TLI R0 PH4 remapping  */
#define AFIO_PCF4_TLI_R1_PI3_REMAP       BIT(22)             /*!< TLI R1 PI3 remapping  */
#define AFIO_PCF4_SPI1_SCK_REMAP         BIT(23)             /*!< SPI1 SCK remapping  */
#define AFIO_PCF4_SPI2_MOSI_REMAP        BIT(24)             /*!< SPI2 MOSI remapping  */

/* AFIO_PCF5 */
#define AFIO_PCF5_I2C2_REMAP0            BIT(0)              /*!< I2C2 remapping 0 */
#define AFIO_PCF5_I2C2_REMAP1            BIT(1)              /*!< I2C2 remapping 1 */
#define AFIO_PCF5_TIMER1_CH0_REMAP       BIT(2)              /*!< TIMER1 CH0 remapping */
#define AFIO_PCF5_TIMER4_REMAP           BIT(3)              /*!< TIMER4 remapping */
#define AFIO_PCF5_TIMER7_CHON_REMAP      BITS(4,5)           /*!< TIMER7 CHON remapping */
#define AFIO_PCF5_TIMER7_CH_REMAP        BIT(6)              /*!< TIMER7 CH remapping */
#define AFIO_PCF5_I2C1_REMAP             BITS(7,8)           /*!< I2C1 remapping */
#define AFIO_PCF5_SPI1_NSCK_REMAP        BITS(9,10)          /*!< SPI1 NSCK remapping */
#define AFIO_PCF5_SPI1_IO_REMAP          BITS(11,12)         /*!< SPI1 IO remapping */
#define AFIO_PCF5_UART3_REMAP            BIT(13)             /*!< UART3 remapping */
#define AFIO_PCF5_TIMER11_REMAP          BIT(14)             /*!< TIMER11 remapping */
#define AFIO_PCF5_CAN0_ADD_REMAP         BIT(15)             /*!< CAN0 ADD remapping */
#define AFIO_PCF5_ENET_TXD3_REMAP        BIT(16)             /*!< ENET TXD3 remapping */
#define AFIO_PCF5_PPS_HI_REMAP           BIT(17)             /*!< ETH_PPS_OUT remapping */
#define AFIO_PCF5_ENET_TXD01_REMAP       BIT(18)             /*!< ETH_TX_EN/ETH_TXD0/ETH_TXD1 remapping */
#define AFIO_PCF5_ENET_CRSCOL_REMAP      BIT(19)             /*!< ETH_MII_CRS/ETH_MII_COL remapping */
#define AFIO_PCF5_ENET_RX_HI_REMAP       BIT(20)             /*!< ETH_RXD2/ETH_RXD3/ETH_RX_ER remapping */
#define AFIO_PCF5_UART6_REMAP            BIT(21)             /*!< UART6 remapping */
#define AFIO_PCF5_USART5_CK_REMAP        BIT(22)             /*!< USART5 CK remapping */
#define AFIO_PCF5_USART5_RTS_REMAP       BIT(23)             /*!< USART5 RTS remapping */
#define AFIO_PCF5_USART5_CTS_REMAP       BIT(24)             /*!< USART5 CTS remapping */
#define AFIO_PCF5_USART5_TX_REMAP        BIT(25)             /*!< USART5 TX remapping */
#define AFIO_PCF5_USART5_RX_REMAP        BIT(26)             /*!< USART5 RX remapping */
#define AFIO_PCF5_EXMC_SDNWE_REMAP       BIT(27)             /*!< EXMC SDNWE remapping */
#define AFIO_PCF5_EXMC_SDCKE0_REMAP      BIT(28)             /*!< EXMC SDCKE0 remapping */
#define AFIO_PCF5_EXMC_SDCKE1_REMAP      BIT(29)             /*!< EXMC SDCKE1 remapping */
#define AFIO_PCF5_EXMC_SDNE0_REMAP       BIT(30)             /*!< EXMC SDNE0 remapping */
#define AFIO_PCF5_EXMC_SDNE1_REMAP       BIT(30)             /*!< EXMC SDNE1 remapping */

/* constants definitions */
typedef FlagStatus bit_status;

/* GPIO mode values set */
#define GPIO_MODE_SET(n, mode)           ((uint32_t)((uint32_t)(mode) << (4U * (n))))
#define GPIO_MODE_MASK(n)                (0xFU << (4U * (n)))

/* GPIO mode definitions */
#define GPIO_MODE_AIN                    ((uint8_t)0x00U)          /*!< analog input mode */
#define GPIO_MODE_IN_FLOATING            ((uint8_t)0x04U)          /*!< floating input mode */
#define GPIO_MODE_IPD                    ((uint8_t)0x28U)          /*!< pull-down input mode */
#define GPIO_MODE_IPU                    ((uint8_t)0x48U)          /*!< pull-up input mode */
#define GPIO_MODE_OUT_OD                 ((uint8_t)0x14U)          /*!< GPIO output with open-drain */
#define GPIO_MODE_OUT_PP                 ((uint8_t)0x10U)          /*!< GPIO output with push-pull */
#define GPIO_MODE_AF_OD                  ((uint8_t)0x1CU)          /*!< AFIO output with open-drain */
#define GPIO_MODE_AF_PP                  ((uint8_t)0x18U)          /*!< AFIO output with push-pull */

