RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_gpio.h
/* GPIO remap definitions */
/* AFIO_PCF0 and AFIO_PCF1 remap definitions */
#define GPIO_SPI0_REMAP                  ((uint32_t)0x00000001U)   /*!< SPI0 remapping */
#define GPIO_I2C0_REMAP                  ((uint32_t)0x00000002U)   /*!< I2C0 remapping */
#define GPIO_USART0_REMAP                ((uint32_t)0x00000004U)   /*!< USART0 remapping */
#define GPIO_USART1_REMAP                ((uint32_t)0x00000008U)   /*!< USART1 remapping */
#define GPIO_USART2_PARTIAL_REMAP        ((uint32_t)0x00140010U)   /*!< USART2 partial remapping */
#define GPIO_USART2_FULL_REMAP           ((uint32_t)0x00140030U)   /*!< USART2 full remapping */
#define GPIO_TIMER0_PARTIAL_REMAP        ((uint32_t)0x00160040U)   /*!< TIMER0 partial remapping */
#define GPIO_TIMER0_FULL_REMAP           ((uint32_t)0x001600C0U)   /*!< TIMER0 full remapping */
#define GPIO_TIMER1_PARTIAL_REMAP0       ((uint32_t)0x00180100U)   /*!< TIMER1 partial remapping */
#define GPIO_TIMER1_PARTIAL_REMAP1       ((uint32_t)0x00180200U)   /*!< TIMER1 partial remapping */
#define GPIO_TIMER1_FULL_REMAP           ((uint32_t)0x00180300U)   /*!< TIMER1 full remapping */
#define GPIO_TIMER2_PARTIAL_REMAP        ((uint32_t)0x001A0800U)   /*!< TIMER2 partial remapping */
#define GPIO_TIMER2_FULL_REMAP           ((uint32_t)0x001A0C00U)   /*!< TIMER2 full remapping */
#define GPIO_TIMER3_REMAP                ((uint32_t)0x00001000U)   /*!< TIMER3 remapping */
#define GPIO_CAN0_PARTIAL_REMAP          ((uint32_t)0x001D4000U)   /*!< CAN0 partial remapping */
#define GPIO_CAN0_FULL_REMAP             ((uint32_t)0x001D6000U)   /*!< CAN0 full remapping */
#define GPIO_PD01_REMAP                  ((uint32_t)0x00008000U)   /*!< PD01 remapping */
#define GPIO_TIMER4CH3_IREMAP            ((uint32_t)0x00200001U)   /*!< TIMER4 channel3 internal remapping */
#define GPIO_ADC0_ETRGINS_REMAP          ((uint32_t)0x00200002U)   /*!< ADC0 external trigger inserted conversion remapping */
#define GPIO_ADC0_ETRGREG_REMAP          ((uint32_t)0x00200004U)   /*!< ADC0 external trigger regular conversion remapping */
#define GPIO_ADC1_ETRGINS_REMAP          ((uint32_t)0x00200008U)   /*!< ADC1 external trigger inserted conversion remapping */
#define GPIO_ADC1_ETRGREG_REMAP          ((uint32_t)0x00200010U)   /*!< ADC1 external trigger regular conversion remapping */
#define GPIO_ENET_REMAP                  ((uint32_t)0x00200020U)   /*!< ENET remapping */
#define GPIO_CAN1_REMAP                  ((uint32_t)0x00200040U)   /*!< CAN1 remapping */
#define GPIO_SWJ_NONJTRST_REMAP          ((uint32_t)0x00300100U)   /*!< full SWJ(JTAG-DP + SW-DP),but without NJTRST */
#define GPIO_SWJ_SWDPENABLE_REMAP        ((uint32_t)0x00300200U)   /*!< JTAG-DP disabled and SW-DP enabled */
#define GPIO_SWJ_DISABLE_REMAP           ((uint32_t)0x00300400U)   /*!< JTAG-DP disabled and SW-DP disabled */
#define GPIO_SPI2_REMAP                  ((uint32_t)0x00201100U)   /*!< SPI2 remapping */
#define GPIO_TIMER1ITI1_REMAP            ((uint32_t)0x00202000U)   /*!< TIMER1 internal trigger 1 remapping */
#define GPIO_PTP_PPS_REMAP               ((uint32_t)0x00204000U)   /*!< ethernet PTP PPS remapping */
#define GPIO_TIMER8_REMAP                ((uint32_t)0x80000020U)   /*!< TIMER8 remapping */
#define GPIO_TIMER9_REMAP                ((uint32_t)0x80000040U)   /*!< TIMER9 remapping */
#define GPIO_TIMER10_REMAP               ((uint32_t)0x80000080U)   /*!< TIMER10 remapping */
#define GPIO_TIMER12_REMAP               ((uint32_t)0x80000100U)   /*!< TIMER12 remapping */
#define GPIO_TIMER13_REMAP               ((uint32_t)0x80000200U)   /*!< TIMER13 remapping */
#define GPIO_EXMC_NADV_REMAP             ((uint32_t)0x80000400U)   /*!< EXMC_NADV connect/disconnect */

/* AFIO_PCF2 remap definitions */
#define GPIO_PCF2_DCI_VSYNC_PG9_REMAP    ((uint32_t)0x00000001U)   /*!< DCI VSYNC remapped to PG9 */
#define GPIO_PCF2_DCI_VSYNC_PI5_REMAP    ((uint32_t)0x00000003U)   /*!< DCI VSYNC remapped to PI5 */
#define GPIO_PCF2_DCI_D0_PC6_REMAP       ((uint32_t)0x00000004U)   /*!< DCI D0 remapped to PC6 */
#define GPIO_PCF2_DCI_D0_PH9_REMAP       ((uint32_t)0x0000000CU)   /*!< DCI D0 remapped to PH9 */
#define GPIO_PCF2_DCI_D1_PC7_REMAP       ((uint32_t)0x00000010U)   /*!< DCI D1 remapped to PC7 */
#define GPIO_PCF2_DCI_D1_PH10_REMAP      ((uint32_t)0x00000030U)   /*!< DCI D1 remapped to PH10 */
#define GPIO_PCF2_DCI_D2_PE0_REMAP       ((uint32_t)0x00000040U)   /*!< DCI D2 remapped to PE0 */
#define GPIO_PCF2_DCI_D2_PG10_REMAP      ((uint32_t)0x00000080U)   /*!< DCI D2 remapped to PG10 */
#define GPIO_PCF2_DCI_D2_PH11_REMAP      ((uint32_t)0x000000C0U)   /*!< DCI D2 remapped to PH11 */
#define GPIO_PCF2_DCI_D3_PE1_REMAP       ((uint32_t)0x00000100U)   /*!< DCI D3 remapped to PE1 */
#define GPIO_PCF2_DCI_D3_PG11_REMAP      ((uint32_t)0x00000200U)   /*!< DCI D3 remapped to PG11 */
#define GPIO_PCF2_DCI_D3_PH12_REMAP      ((uint32_t)0x00000300U)   /*!< DCI D3 remapped to PH12 */
#define GPIO_PCF2_DCI_D4_PE4_REMAP       ((uint32_t)0x00000400U)   /*!< DCI D4 remapped to PE4 */
#define GPIO_PCF2_DCI_D4_PH14_REMAP      ((uint32_t)0x00000C00U)   /*!< DCI D4 remapped to PH14 */
#define GPIO_PCF2_DCI_D5_PD3_REMAP       ((uint32_t)0x00001000U)   /*!< DCI D5 remapped to PD3 */
#define GPIO_PCF2_DCI_D5_PI4_REMAP       ((uint32_t)0x00003000U)   /*!< DCI D5 remapped to PI4 */
#define GPIO_PCF2_DCI_D6_PE5_REMAP       ((uint32_t)0x00004000U)   /*!< DCI D6 remapped to PE5 */
#define GPIO_PCF2_DCI_D6_PI6_REMAP       ((uint32_t)0x0000C000U)   /*!< DCI D6 remapped to PI6 */
#define GPIO_PCF2_DCI_D7_PE6_REMAP       ((uint32_t)0x00010000U)   /*!< DCI D7 remapped to PE6 */
#define GPIO_PCF2_DCI_D7_PI7_REMAP       ((uint32_t)0x00030000U)   /*!< DCI D7 remapped to PI7 */
#define GPIO_PCF2_DCI_D8_PH6_REMAP       ((uint32_t)0x00040000U)   /*!< DCI D8 remapped to PH6 */
#define GPIO_PCF2_DCI_D8_PI1_REMAP       ((uint32_t)0x000C0000U)   /*!< DCI D8 remapped to PI1 */
#define GPIO_PCF2_DCI_D9_PH7_REMAP       ((uint32_t)0x00100000U)   /*!< DCI D9 remapped to PH7 */
#define GPIO_PCF2_DCI_D9_PI2_REMAP       ((uint32_t)0x00300000U)   /*!< DCI D9 remapped to PI2 */
#define GPIO_PCF2_DCI_D10_PD6_REMAP      ((uint32_t)0x00400000U)   /*!< DCI D10 remapped to PD6 */
#define GPIO_PCF2_DCI_D10_PI3_REMAP      ((uint32_t)0x00C00000U)   /*!< DCI D10 remapped to PI3 */
#define GPIO_PCF2_DCI_D11_PF10_REMAP     ((uint32_t)0x01000000U)   /*!< DCI D11 remapped to PF10 */
#define GPIO_PCF2_DCI_D11_PH15_REMAP     ((uint32_t)0x03000000U)   /*!< DCI D11 remapped to PH15 */
#define GPIO_PCF2_DCI_D12_PG6_REMAP      ((uint32_t)0x04000000U)   /*!< DCI D12 remapped to PG6 */
#define GPIO_PCF2_DCI_D13_PG15_REMAP     ((uint32_t)0x08000000U)   /*!< DCI D12 remapped to PG15 */
#define GPIO_PCF2_DCI_D13_PI0_REMAP      ((uint32_t)0x18000000U)   /*!< DCI D13 remapped to PI0 */
#define GPIO_PCF2_DCI_HSYNC_PH8_REMAP    ((uint32_t)0x20000000U)   /*!< DCI HSYNC to PH8 */
#define GPIO_PCF2_PH01_REMAP             ((uint32_t)0x80000000U)   /*!< PH0/PH1 remapping */

/* AFIO_PCF3 remap definitions */
#define GPIO_PCF3_TLI_B5_PA3_REMAP       ((uint32_t)0x00000001U)   /*!< TLI B5 remapped to PA3 */
#define GPIO_PCF3_TLI_VSYNC_PA4_REMAP    ((uint32_t)0x00000002U)   /*!< TLI VSYNC remapped to PA4 */
#define GPIO_PCF3_TLI_G2_PA6_REMAP       ((uint32_t)0x00000004U)   /*!< TLI G2 remapped to PA6 */
#define GPIO_PCF3_TLI_R6_PA8_REMAP       ((uint32_t)0x00000008U)   /*!< TLI R6 remapped to PA8 */
#define GPIO_PCF3_TLI_R4_PA11_REMAP      ((uint32_t)0x00000010U)   /*!< TLI R4 remapped to PA11 */
#define GPIO_PCF3_TLI_R5_PA12_REMAP      ((uint32_t)0x00000020U)   /*!< TLI R5 remapped to PA12 */
#define GPIO_PCF3_TLI_R3_PB0_REMAP       ((uint32_t)0x00000040U)   /*!< TLI R3 remapped to PB0 */
#define GPIO_PCF3_TLI_R6_PB1_REMAP       ((uint32_t)0x00000080U)   /*!< TLI R6 remapped to PB1 */
#define GPIO_PCF3_TLI_B6_PB8_REMAP       ((uint32_t)0x00000100U)   /*!< TLI B6 remapped to PB8 */
#define GPIO_PCF3_TLI_B7_PB9_REMAP       ((uint32_t)0x00000200U)   /*!< TLI B7 remapped to PB9 */
#define GPIO_PCF3_TLI_G4_PB10_REMAP      ((uint32_t)0x00000400U)   /*!< TLI G4 remapped to PB10 */
#define GPIO_PCF3_TLI_G5_PB11_REMAP      ((uint32_t)0x00000800U)   /*!< TLI G5 remapped to PB11 */
#define GPIO_PCF3_TLI_HSYNC_PC6_REMAP    ((uint32_t)0x00001000U)   /*!< TLI HSYNC remapped to PC6 */
#define GPIO_PCF3_TLI_G6_PC7_REMAP       ((uint32_t)0x00002000U)   /*!< TLI G6 remapped to PC7 */
#define GPIO_PCF3_TLI_R2_PC10_REMAP      ((uint32_t)0x00004000U)   /*!< TLI R2 remapped to PC10 */
#define GPIO_PCF3_TLI_G7_PD3_REMAP       ((uint32_t)0x00008000U)   /*!< TLI G7 remapped to PD3 */
#define GPIO_PCF3_TLI_B2_PD6_REMAP       ((uint32_t)0x00010000U)   /*!< TLI B2 remapped to PD6 */
#define GPIO_PCF3_TLI_B3_PD10_REMAP      ((uint32_t)0x00020000U)   /*!< TLI B3 remapped to PD10 */
#define GPIO_PCF3_TLI_B0_PE4_REMAP       ((uint32_t)0x00040000U)   /*!< TLI B0 remapped to PE4 */
#define GPIO_PCF3_TLI_G0_PE5_REMAP       ((uint32_t)0x00080000U)   /*!< TLI G0 remapped to PE5 */
#define GPIO_PCF3_TLI_G1_PE6_REMAP       ((uint32_t)0x00100000U)   /*!< TLI G1 remapped to PE6 */
#define GPIO_PCF3_TLI_G3_PE11_REMAP      ((uint32_t)0x00200000U)   /*!< TLI G3 remapped to PE11 */
#define GPIO_PCF3_TLI_B4_PE12_REMAP      ((uint32_t)0x00400000U)   /*!< TLI B4 remapped to PE12 */
#define GPIO_PCF3_TLI_DE_PE13_REMAP      ((uint32_t)0x00800000U)   /*!< TLI DE remapped to PE13 */
#define GPIO_PCF3_TLI_CLK_PE14_REMAP     ((uint32_t)0x01000000U)   /*!< TLI CLK remapped to PE14 */
#define GPIO_PCF3_TLI_R7_PE15_REMAP      ((uint32_t)0x02000000U)   /*!< TLI R7 remapped to PE15 */
#define GPIO_PCF3_TLI_DE_PF10_REMAP      ((uint32_t)0x04000000U)   /*!< TLI DE remapped to PF10 */
#define GPIO_PCF3_TLI_R7_PG6_REMAP       ((uint32_t)0x08000000U)   /*!< TLI R7 remapped to PG6 */
#define GPIO_PCF3_TLI_CLK_PG7_REMAP      ((uint32_t)0x10000000U)   /*!< TLI CLK remapped to PG7 */
#define GPIO_PCF3_TLI_G3_PG10_REMAP      ((uint32_t)0x20000000U)   /*!< TLI G3 remapped to PG10 */
#define GPIO_PCF3_TLI_B2_PG10_REMAP      ((uint32_t)0x40000000U)   /*!< TLI B2 remapped to PG10 */
#define GPIO_PCF3_TLI_B3_PG11_REMAP      ((uint32_t)0x80000000U)   /*!< TLI B3 remapped to PG11 */

/* AFIO_PCF4 remap definitions */
#define GPIO_PCF4_TLI_B4_PG12_REMAP      ((uint32_t)0x00000001U)   /*!< TLI B4 remapped to PG12 */
#define GPIO_PCF4_TLI_B1_PG12_REMAP      ((uint32_t)0x00000002U)   /*!< TLI B1 remapped to PG12 */
#define GPIO_PCF4_TLI_R0_PH2_REMAP2      ((uint32_t)0x00000004U)   /*!< TLI R0 remapped to PH2 */
#define GPIO_PCF4_TLI_R1_PH3_REMAP       ((uint32_t)0x00000008U)   /*!< TLI R1 remapped to PH3 */
#define GPIO_PCF4_TLI_R2_PH8_REMAP       ((uint32_t)0x00000010U)   /*!< TLI R2 remapped to PH8 */
#define GPIO_PCF4_TLI_R3_PH9_REMAP       ((uint32_t)0x00000020U)   /*!< TLI R3 remapped to PH9 */
#define GPIO_PCF4_TLI_R4_PH10_REMAP      ((uint32_t)0x00000040U)   /*!< TLI R4 remapped to PH10 */
#define GPIO_PCF4_TLI_R5_PH11_REMAP      ((uint32_t)0x00000080U)   /*!< TLI R5 remapped to PH11 */
#define GPIO_PCF4_TLI_R6_PH12_REMAP      ((uint32_t)0x00000100U)   /*!< TLI R6 remapped to PH12 */
#define GPIO_PCF4_TLI_G2_PH13_REMAP      ((uint32_t)0x00000200U)   /*!< TLI G2 remapped to PH13 */
#define GPIO_PCF4_TLI_G3_PH14_REMAP      ((uint32_t)0x00000400U)   /*!< TLI G3 remapped to PH14 */
#define GPIO_PCF4_TLI_G4_PH15_REMAP      ((uint32_t)0x00000800U)   /*!< TLI G4 remapped to PH15 */
#define GPIO_PCF4_TLI_G5_PI0_REMAP       ((uint32_t)0x00001000U)   /*!< TLI G5 remapped to PI0 */
#define GPIO_PCF4_TLI_G6_PI1_REMAP       ((uint32_t)0x00002000U)   /*!< TLI G6 remapped to PI1 */
#define GPIO_PCF4_TLI_G7_PI2_REMAP       ((uint32_t)0x00004000U)   /*!< TLI G7 remapped to PI2 */
#define GPIO_PCF4_TLI_B4_PI4_REMAP       ((uint32_t)0x00008000U)   /*!< TLI B4 remapped to PI4 */
#define GPIO_PCF4_TLI_B5_PI5_REMAP       ((uint32_t)0x00010000U)   /*!< TLI B5 remapped to PI5 */
#define GPIO_PCF4_TLI_B6_PI6_REMAP       ((uint32_t)0x00020000U)   /*!< TLI B6 remapped to PI6 */
#define GPIO_PCF4_TLI_B7_PI7_REMAP       ((uint32_t)0x00040000U)   /*!< TLI B7 remapped to PI7 */
#define GPIO_PCF4_TLI_VSYNC_PI9_REMAP    ((uint32_t)0x00080000U)   /*!< TLI VSYNC remapped to PI9 */
#define GPIO_PCF4_TLI_HSYNC_PI10_REMAP   ((uint32_t)0x00100000U)   /*!< TLI HSYNC remapped to PI10 */
#define GPIO_PCF4_TLI_R0_PH4_REMAP       ((uint32_t)0x00200000U)   /*!< TLI R0 remapped to PH4 */
#define GPIO_PCF4_TLI_R1_PI3_REMAP       ((uint32_t)0x00400000U)   /*!< TLI R1 remapped to PI3 */
#define GPIO_PCF4_SPI1_SCK_PD3_REMAP     ((uint32_t)0x00800000U)   /*!< SPI1 SCK remapped to PD3 */
#define GPIO_PCF4_SPI2_MOSI_PD6_REMAP    ((uint32_t)0x01000000U)   /*!< SPI2 MOSI remapped to PD6 */

/* AFIO_PCF5 remap definitions */
#define GPIO_PCF5_I2C2_REMAP0            ((uint32_t)0x00000001U)   /*!< I2C2 remapping 0 */
#define GPIO_PCF5_I2C2_REMAP1            ((uint32_t)0x00000002U)   /*!< I2C2 remapping 1 */
#define GPIO_PCF5_TIMER1_CH0_REMAP       ((uint32_t)0x00000004U)   /*!< TIMER1 CH0 remapped to PA5 */
#define GPIO_PCF5_TIMER4_REMAP           ((uint32_t)0x00000008U)   /*!< TIMER4 CH0 remapping */
#define GPIO_PCF5_TIMER7_CHON_REMAP0     ((uint32_t)0x00000020U)   /*!< TIMER7 CHON remapping 0 */
#define GPIO_PCF5_TIMER7_CHON_REMAP1     ((uint32_t)0x00000030U)   /*!< TIMER7 CHON remapping 1 */
#define GPIO_PCF5_TIMER7_CH_REMAP        ((uint32_t)0x00000040U)   /*!< TIMER7 CH remapping */
#define GPIO_PCF5_I2C1_REMAP0            ((uint32_t)0x00000100U)   /*!< I2C1 remapping 0 */
#define GPIO_PCF5_I2C1_REMAP1            ((uint32_t)0x00000180U)   /*!< I2C1 remapping 1 */
#define GPIO_PCF5_SPI1_NSCK_REMAP0       ((uint32_t)0x00000400U)   /*!< SPI1 NSS/SCK remapping 0 */
#define GPIO_PCF5_SPI1_NSCK_REMAP1       ((uint32_t)0x00000600U)   /*!< SPI1 NSS/SCK remapping 1 */
#define GPIO_PCF5_SPI1_IO_REMAP0         ((uint32_t)0x00000800U)   /*!< SPI1 MISO/MOSI remapping 0 */
#define GPIO_PCF5_SPI1_IO_REMAP1         ((uint32_t)0x00001800U)   /*!< SPI1 MISO/MOSI remapping 1 */
#define GPIO_PCF5_UART3_REMAP            ((uint32_t)0x00002000U)   /*!< UART3 remapping */
#define GPIO_PCF5_TIMER11_REMAP          ((uint32_t)0x00004000U)   /*!< TIMER11 remapping */
#define GPIO_PCF5_CAN0_ADD_REMAP         ((uint32_t)0x00008000U)   /*!< CAN0 addition remapping */
#define GPIO_PCF5_ENET_TXD3_REMAP        ((uint32_t)0x00010000U)   /*!< ETH_TXD3 remapped to PE2 */
#define GPIO_PCF5_PPS_HI_REMAP           ((uint32_t)0x00020000U)   /*!< ETH_PPS_OUT remapped to PG8 */
#define GPIO_PCF5_ENET_TXD01_REMAP       ((uint32_t)0x00040000U)   /*!< ETH_TX_EN/ETH_TXD0/ETH_TXD1 remapping */
#define GPIO_PCF5_ENET_CRSCOL_REMAP      ((uint32_t)0x00080000U)   /*!< ETH_MII_CRS/ETH_MII_COL remapping */
#define GPIO_PCF5_ENET_RX_HI_REMAP       ((uint32_t)0x00100000U)   /*!< ETH_RXD2/ETH_RXD3/ETH_RX_ER remapping */
#define GPIO_PCF5_UART6_REMAP            ((uint32_t)0x00200000U)   /*!< UART6 remapping */
#define GPIO_PCF5_USART5_CK_PG7_REMAP    ((uint32_t)0x00400000U)   /*!< USART5 CK remapped to PG7 */
#define GPIO_PCF5_USART5_RTS_PG12_REMAP  ((uint32_t)0x00800000U)   /*!< USART5 RTS remapped to PG12 */
#define GPIO_PCF5_USART5_CTS_PG13_REMAP  ((uint32_t)0x01000000U)   /*!< USART5 CTS remapped to PG13 */
#define GPIO_PCF5_USART5_TX_PG14_REMAP   ((uint32_t)0x02000000U)   /*!< USART5 TX remapped to PG14 */
#define GPIO_PCF5_USART5_RX_PG9_REMAP    ((uint32_t)0x04000000U)   /*!< USART5 RX remapped to PG9 */
#define GPIO_PCF5_EXMC_SDNWE_PC0_REMAP   ((uint32_t)0x08000000U)   /*!< EXMC SDNWE remapped to PC0 */
#define GPIO_PCF5_EXMC_SDCKE0_PC3_REMAP  ((uint32_t)0x10000000U)   /*!< EXMC SDCKE0 remapped to PC3 */
#define GPIO_PCF5_EXMC_SDCKE1_PB5_REMAP  ((uint32_t)0x20000000U)   /*!< EXMC SDCKE1 remapped to PB5 */
#define GPIO_PCF5_EXMC_SDNE0_PC2_REMAP   ((uint32_t)0x40000000U)   /*!< EXMC SDNE0 remapped to PC2 */
#define GPIO_PCF5_EXMC_SDNE1_PB6_REMAP   ((uint32_t)0x80000000U)   /*!< EXMC SDNE1 remapped to PB6 */

/* AFIO port configuration register selection */
#define GPIO_PCF2                        ((uint8_t)0x02U)          /*!< AFIO port configuration register 2 */
#define GPIO_PCF3                        ((uint8_t)0x03U)          /*!< AFIO port configuration register 3 */
#define GPIO_PCF4                        ((uint8_t)0x04U)          /*!< AFIO port configuration register 4 */
#define GPIO_PCF5                        ((uint8_t)0x05U)          /*!< AFIO port configuration register 5*/

/* ethernet MII or RMII PHY selection */
#define GPIO_ENET_PHY_MII                ((uint32_t)0x00000000U)   /*!< configure ethernet MAC for connection with an MII PHY */
#define GPIO_ENET_PHY_RMII               AFIO_PCF0_ENET_PHY_SEL    /*!< configure ethernet MAC for connection with an RMII PHY */

/* function declarations */
/* initialization functions */
/* reset GPIO port */
void gpio_deinit(uint32_t gpio_periph);
/* reset alternate function I/O(AFIO) */
void gpio_afio_deinit(void);
/* GPIO parameter initialization */
void gpio_init(uint32_t gpio_periph, uint32_t mode, uint32_t speed, uint32_t pin);

